# ================= Экран =============================
SCREEN_WIDTH = 1200
SCREEN_HEIGHT = 800
GAME_TITLE = "Vampire Survivors"
# =====================================================

# ================== Цвета ============================
DEEP_SKY_BLUE = (0, 191, 255)
GRAY = (128, 128, 128)
DIM_GRAY = (105, 105, 105)
GAINSBORO = (220, 220, 220)
BLACK = (0, 0, 0)
# =====================================================

# ==================== Герой ==========================
#Параметры спрайта
SPRITE_PATH = "./Characters/sprites/hero/hero.png"
# =====================================================

# ==================== Враг ===========================
#Параметры спрайта
SPRITE_PATH = "./Characters/sprites/enemies/spritepaint.png"
# =====================================================

# ==================== Поле ===========================
#Размеры
WORLD_WIDTH = 2400
WORLD_HEIGHT = 1800

#Параметры спрайта
GROUND_SPRITE_PATH = "./Poly/sprites/ground.webp"

# ==================== Спавн врагов ===================
SPAWN_DELAY = 1.0
MAX_ENEMIES = 1000